[metadata]
creation_date = "2026/06/16"
updated_date = "2026/06/16"

[rule]
author = ["Your Team"]
description = "Test rule to verify Detection as Code pipeline"
index = ["logs-endpoint.events.*"]
language = "eql"
name = "DaC Test Rule"
query = '''
process where process.name == "cmd.exe"
'''
risk_score = 21
severity = "low"
type = "eql"
rule_id = "12345678-1234-1234-1234-123456789abc"
